
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Modelagem de Processos Organizacionais · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="libras.html" />
    
    
    <link rel="prev" href="engenharia-requisitos.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introdução
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    2° Período em Sistemas de Informação
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../../sistemas-informacao/segundo-periodo/linguagem-c.html">
            
                <a href="../../sistemas-informacao/segundo-periodo/linguagem-c.html">
            
                    
                    Linguagem C
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../../sistemas-informacao/segundo-periodo/comunicacao-dados.html">
            
                <a href="../../sistemas-informacao/segundo-periodo/comunicacao-dados.html">
            
                    
                    Comunicação de Dados
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../../sistemas-informacao/segundo-periodo/modelagem-dados.html">
            
                <a href="../../sistemas-informacao/segundo-periodo/modelagem-dados.html">
            
                    
                    Modelagem de Dados
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    2° Período em Análise de Sistemas
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../segundo-periodo/projetos-uml.html">
            
                <a href="../segundo-periodo/projetos-uml.html">
            
                    
                    Analise e Projeto Orientados a Objeto
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../segundo-periodo/engenharia-software.html">
            
                <a href="../segundo-periodo/engenharia-software.html">
            
                    
                    Engenharia de Software
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    3° Período em Analise de Sistemas
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="engenharia-requisitos.html">
            
                <a href="engenharia-requisitos.html">
            
                    
                    Engenharia de Requisitos
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.2" data-path="modelagem-processos.html">
            
                <a href="modelagem-processos.html">
            
                    
                    Modelagem de Processos Organizacionais
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="libras.html">
            
                <a href="libras.html">
            
                    
                    Libras
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >Modelagem de Processos Organizacionais</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="modelagem-de-processos-organizacionais">Modelagem de Processos Organizacionais</h1>
<ul>
<li><a href="#teorias-da-administra%C3%A7%C3%A3o">Teorias da Administra&#xE7;&#xE3;o</a><ul>
<li><a href="#o-que-seriam-sistemas-abertos">O que seriam sistemas abertos?</a></li>
<li><a href="#o-que-seria-a-teoria-geral-dos-sistemas">O que seria a Teoria Geral dos Sistemas?</a></li>
<li><a href="#o-que-seria-a-teoria-sociot%C3%A9cnica">O que seria a Teoria sociot&#xE9;cnica?</a></li>
<li><a href="#o-que-seria-a-teoria-da-conting%C3%AAncia">O que seria a Teoria da conting&#xEA;ncia?</a></li>
</ul>
</li>
</ul>
<h2 id="teorias-da-administra&#xE7;&#xE3;o">Teorias da Administra&#xE7;&#xE3;o</h2>
<p>Teorias da Administra&#xE7;&#xE3;o contribuem para o modelo de gest&#xE3;o das mesmas. Organiza&#xE7;&#xF5;es, no contexto atual, podem ser considerados sistemas abertos.</p>
<h3 id="o-que-seriam-sistemas-abertos">O que seriam sistemas abertos?</h3>
<p>Segundo Von Bertalanffy, um sistema aberto &#xE9; como um complexo de elementos em intera&#xE7;&#xE3;o e em interc&#xE2;mbio cont&#xED;nuo com o ambiente.</p>
<h3 id="o-que-seria-a-teoria-geral-dos-sistemas">O que seria a Teoria Geral dos Sistemas?</h3>
<p>A Teoria Geral dos sistemas &#xE9; a tentativa de compreender os diversos sistemas cient&#xED;ficos de maneira integrada. Ela se baseia nos seguintes pressupostos:</p>
<ul>
<li>H&#xE1; uma tend&#xEA;ncia para a integra&#xE7;&#xE3;o nas v&#xE1;rias ci&#xEA;ncias naturais e sociais. &#x2022; Tal integra&#xE7;&#xE3;o parece orientar-se para uma teoria dos sistemas.</li>
<li>Essa teoria pode ser ummeio importante de objetivar os campos n&#xE3;o do conhe- cimento cient&#xED;fico, especialmente nas ci&#xEA;ncias sociais.</li>
<li>Desenvolvendo princ&#xED;pios unificadores que atravessam verticalmente os uni- versos particulares das diversas ci&#xEA;ncias, essa teoria aproxima-nos do objetivo da unidade da ci&#xEA;ncia.</li>
<li>Isso pode levar a uma integra&#xE7;&#xE3;o muito necess&#xE1;ria na educa&#xE7;&#xE3;o cient&#xED;fica</li>
</ul>
<p>A teoria geral dos sistemas, quando aplicado a Administra&#xE7;&#xE3;o, entende que as empresas s&#xE3;o organiza&#xE7;&#xF5;es que, a partir de insumos, produzem produtos e / ou servi&#xE7;os, e, ao fazer essa produ&#xE7;&#xE3;o, tem nela suas pr&#xF3;prias organiza&#xE7;&#xF5;es que se relacionam e cooperam para essa produ&#xE7;&#xE3;o.</p>
<h3 id="o-que-seria-a-teoria-sociot&#xE9;cnica">O que seria a Teoria sociot&#xE9;cnica?</h3>
<p>Ela pressup&#xF5;e que a organiza&#xE7;&#xE3;o se divide em duas partes: a <strong>t&#xE9;cnica</strong> e a <strong>social</strong>.</p>
<ul>
<li><strong>T&#xE9;cnica</strong>: compreende o potencial de produ&#xE7;&#xE3;o de uma organiza&#xE7;&#xE3;o. S&#xE3;o as demandas da tarefa, s&#xE3;o os equipamentos t&#xE9;cnicos etc.</li>
<li><strong>Social</strong>: compreende as rela&#xE7;&#xF5;es sociais dos pr&#xF3;prios funcion&#xE1;rios da empresa. <em>Elas transformam a efici&#xEA;ncia potencial da empresa em efici&#xEA;ncia real</em>.</li>
</ul>
<h3 id="o-que-seria-a-teoria-da-conting&#xEA;ncia">O que seria a Teoria da conting&#xEA;ncia?</h3>
<p>Afirma que n&#xE3;o h&#xE1; um modelo correto para uma organiza&#xE7;&#xE3;o. Que tal modelo nasce da rela&#xE7;&#xE3;o da empresa com o ambiente externo. Ela se baseia nos seguintes pressupostos:</p>
<ul>
<li>A organiza&#xE7;&#xE3;o &#xE9; um sistema aberto;</li>
<li>As caracter&#xED;sticas organizacionais apresentam uma intera&#xE7;&#xE3;o entre si e com o ambiente; </li>
<li>As caracter&#xED;sticas ambientais funcionam como vari&#xE1;veis independentes, enquanto as caracter&#xED;sticas organizacionais s&#xE3;o vari&#xE1;veis dependentes.</li>
</ul>
<p>Fontes:</p>
<ul>
<li><a href="http://www.unicamp.br/fea/ortega/temas530/melissa.htm" target="_blank">http://www.unicamp.br/fea/ortega/temas530/melissa.htm</a></li>
<li><a href="https://www.portaleducacao.com.br/conteudo/artigos/educacao/teoria-geral-dos-sistemas-e-os-sistemas-de-informacao/59309" target="_blank">https://www.portaleducacao.com.br/conteudo/artigos/educacao/teoria-geral-dos-sistemas-e-os-sistemas-de-informacao/59309</a></li>
<li><a href="http://casadaconsultoria.com.br/teoria-contingencial/" target="_blank">http://casadaconsultoria.com.br/teoria-contingencial/</a></li>
</ul>
<h3 id="teoria-cient&#xED;fica-da-administra&#xE7;&#xE3;o">Teoria Cient&#xED;fica da Administra&#xE7;&#xE3;o</h3>
<p>Tem com principal autor, Frederick Winslow Taylor. Este entendia que havia um desperd&#xED;cio de recursos e que existia uma forma correta de uma organiza&#xE7;&#xE3;o maximizar sua produ&#xE7;&#xE3;o. Para isso, prop&#xF4;s o que ficou conhecido como <strong>ORT - Organiza&#xE7;&#xE3;o Racional do Trabalho</strong>. Os princ&#xED;pios da ORT s&#xE3;o:</p>
<ul>
<li>Divis&#xE3;o clara entre quem comanda e quem executa (sele&#xE7;&#xE3;o cient&#xED;fica do trabalhador)</li>
<li>Uma &#xEA;nfase na tarefa</li>
<li>Padroniza&#xE7;&#xE3;o do trabalho e treinamento extensivo</li>
</ul>
<p>Para a Administra&#xE7;&#xE3;o Cient&#xED;fica, o homem &#xE9; um ser pregui&#xE7;oso, que, no desejo de n&#xE3;o passar fome, trabalha para ganhar seu sustento.</p>
<h3 id="teoria-cl&#xE1;ssica-e-neocl&#xE1;ssica">Teoria Cl&#xE1;ssica e neocl&#xE1;ssica</h3>
<p>A teoria cl&#xE1;ssica foca em:</p>
<ul>
<li>Defini&#xE7;&#xE3;o de <strong>estrutura</strong></li>
<li>Defini&#xE7;&#xE3;o de <strong>pap&#xE9;is</strong></li>
</ul>
<p>J&#xE1; a teoria neocl&#xE1;ssica:</p>
<ul>
<li>Foco nos <strong>objetivos</strong> e nas <strong>metas</strong></li>
</ul>
<p>As principais caracter&#xED;sticas s&#xE3;o:</p>
<ul>
<li>Divis&#xE3;o do trabalho</li>
<li>Centraliza&#xE7;&#xE3;o das decis&#xF5;es</li>
<li>Pequena amplitude de controle</li>
</ul>
<h4 id="processo-administrativo">Processo administrativo</h4>
<p>Veja como, no diagrama abaixo, a teoria neocl&#xE1;ssica entende o papel do gestor:</p>
<p><img src="../images/modelagem-processos/papel-administrador.png" alt="Papeis do gestor"></p>
<h4 id="o-que-&#xE9;-organograma">O que &#xE9; organograma?</h4>
<p>&#xC9; como ocorre a especializa&#xE7;&#xE3;o do trabalho na organiza&#xE7;&#xE3;o. Um organograma mostra a organiza&#xE7;&#xE3;o em diferentes <strong>setores administrativos</strong>.</p>
<h4 id="conceitos-de-linha-e-staff">Conceitos de linha e staff</h4>
<p>Linha &#xE9; a hierarquia da empresa bem como voc&#xEA; se encontra nela (a quem comanda e quem te comanda). J&#xE1; a <em>staff</em> &#xE9; a acessoria prestada por terceiros. Na <em>staff</em> n&#xE3;o ocorre a subordina&#xE7;&#xE3;o.</p>
<h3 id="teoria-das-rela&#xE7;&#xF5;es-humanas">Teoria das rela&#xE7;&#xF5;es humanas</h3>
<p>Segundo essa escola, o ser humano &#xE9; enxergado como um <em>homos socialis</em>, ou seja, um ser dotado de sentimentos e temores, que procura ser aceito na sociedade em que est&#xE1; e procura tamb&#xE9;m ter poder decis&#xF3;rio. Uma outra defini&#xE7;&#xE3;o &#xE9; a de que o a efici&#xEA;ncia do trabalho est&#xE1; ligada ao contexto social e n&#xE3;o somente suas necessidades prim&#xE1;rias.</p>
<h3 id="teorias-comportamentais-e-de-lideran&#xE7;a">Teorias comportamentais e de lideran&#xE7;a</h3>
<p>Segundo esses movimentos, a administra&#xE7;&#xE3;o de uma organiza&#xE7;&#xE3;o deve propor a <strong>ger&#xEA;ncia participativa</strong> e a <strong>melhoria do clima de trabalho</strong>.</p>
<h4 id="hierarquia-das-necessidades-humanas-de-maslow">Hierarquia das necessidades humanas de Maslow</h4>
<p>Segundo Maslow, o ser humanno busca no trabalho a oportunidade de satisfazer suas necessidades, desde as mais b&#xE1;sicas at&#xE9; a satisfa&#xE7;&#xE3;o pessoal. Veja abaixo as categorias:</p>
<p><img src="../images/modelagem-processos/hierarquia-de-necessidades-de-maslow.jpg" alt="Pir&#xE2;mide de Maslow"></p>
<h4 id="teoria-x">Teoria X</h4>
<p>As pessoas s&#xE3;o pregui&#xE7;osas e indolentes, n&#xE3;o querem trabalhar. Portanto, &#xE9; necess&#xE1;rio que a gest&#xE3;o tenha pulso firme e puna o trabalhador que n&#xE3;o comprir com o acordado</p>
<h4 id="teoria-y">Teoria Y</h4>
<p>As pessoas gostam de trabalhar, e tamb&#xE9;m veem no trabalho a possibilidade de crescimento pessoal. A tarefa da gest&#xE3;o &#xE9; proporcionar esse ambiente de livre iniciativa do trabalhador.</p>
<p>As duas teorias anteriores s&#xE3;o de Douglas McGregor</p>
<h4 id="teoria-dos-dois-fatores">Teoria dos dois fatores</h4>
<p>Segundo Herzberg, o ser humano, ao trabalhar, possui duas atitudes:</p>
<ul>
<li>Satisfazer sua necessidades b&#xE1;sicas (<strong>fatores higi&#xEA;nicos</strong>)</li>
<li>Aperfei&#xE7;oamento de suas habilidades, seu esp&#xED;rito e seu potencial humano (<strong>fatores motivacionais</strong>)</li>
</ul>
<h3 id="o-que-&#xE9;-burocracia">O que &#xE9; burocracia?</h3>
<p>A intera&#xE7;&#xE3;o entre os indiv&#xED;duos deve seguir regras claras e padr&#xF5;es impessoais. O objetivo &#xE9; evitar a arbitrariedade e organizar a atividade humana de maneira est&#xE1;vel e que cumpra os fins propostos. Segundo essa l&#xF3;gica, a atividade humana deve seguir rotinas e procedimentos bem alinhados. Veja abaixo um quadro que ilustra bem essa situa&#xE7;&#xE3;o:</p>
<p><img src="../images/modelagem-processos/estrutura-burocratica-weber.png" alt="Estrutura Burocr&#xE1;tica de Weber"></p>
<p>Para um aprofundamento do conceito de burocracia, leia:</p>
<ul>
<li><a href="http://egov.ufsc.br/portal/conteudo/racionaliza%C3%A7%C3%A3o-do-direito-uma-discuss%C3%A3o-sobre-uma-prova-inusitada-carta-psicografada" target="_blank">A racionaliza&#xE7;&#xE3;o do Direito: uma discuss&#xE3;o sobre uma prova inusitada, a carta psicografada</a></li>
</ul>
<h2 id="a-produ&#xE7;&#xE3;o-como-ferramenta-estrat&#xE9;gica">A produ&#xE7;&#xE3;o como ferramenta estrat&#xE9;gica</h2>
<h3 id="o-que-&#xE9;-estrat&#xE9;gia">O que &#xE9; estrat&#xE9;gia?</h3>
<blockquote>
<p>A arte de alcan&#xE7;ar resultados. Citando o conte&#xFA;do da faculdade, &#xE9; um padr&#xE3;o geral para o alcance de objetivos.</p>
</blockquote>
<h3 id="quais-os-n&#xED;veis-da-estrat&#xE9;gia">Quais os n&#xED;veis da estrat&#xE9;gia?</h3>
<p>Existem tr&#xEA;s n&#xED;veis prim&#xE1;rios de estrat&#xE9;gia:</p>
<ul>
<li>Corporativo</li>
<li>Comercial</li>
<li>Funcional</li>
</ul>
<p>A <strong>estrat&#xE9;gia corporativa</strong> possui dus &#xE1;reas de interesse:</p>
<ul>
<li>Os neg&#xF3;cios que a corpora&#xE7;&#xE3;o ir&#xE1; participar</li>
<li>Aquisi&#xE7;&#xE3;o de recursos</li>
</ul>
<p>J&#xE1; a <strong>estrat&#xE9;gia comercial</strong> possui duas tarefas:</p>
<ul>
<li>Estabelecer os limites da empresa vinculando a parte corporativa com o comercial</li>
<li>Estabele a base da empresa para uma vantagem competitiva</li>
</ul>
<p>Por fim, <strong>a estrat&#xE9;gia funcional</strong> dever&#xE1; ser desenvolvida e seguida com o objetivo de sustentar a estrat&#xE9;gia comercial</p>
<h3 id="quem-afeta-o-estabelecimento-de-prioridades-da-produ&#xE7;&#xE3;o">Quem afeta o estabelecimento de prioridades da produ&#xE7;&#xE3;o</h3>
<ul>
<li>Consumidores</li>
<li>Concorrentes</li>
<li>Ciclo de vida do produto</li>
</ul>
<h2 id="layout-de-produ&#xE7;&#xE3;o">Layout de produ&#xE7;&#xE3;o</h2>
<h3 id="o-que-&#xE9;-um-layout-de-produ&#xE7;&#xE3;o">O que &#xE9; um layout de produ&#xE7;&#xE3;o?</h3>
<blockquote>
<p>O layout de produ&#xE7;&#xE3;o, tamb&#xE9;m denominado arranjo f&#xED;sico, &#xE9; uma representa&#xE7;&#xE3;o gr&#xE1;fica do ch&#xE3;o de f&#xE1;brica. Mais do que uma planta, &#xE9; uma t&#xE9;cnica utilizada para definir a distribui&#xE7;&#xE3;o e disposi&#xE7;&#xE3;o f&#xED;sica dos componentes da &#xE1;rea de produ&#xE7;&#xE3;o. O objetivo &#xE9; organizar o espa&#xE7;o f&#xED;sico do ch&#xE3;o de f&#xE1;brica localizando os equipamentos e postos de trabalho de forma a obter maior efici&#xEA;ncia na produ&#xE7;&#xE3;o.</p>
<p>fonte: <a href="http://www.sispro.com.br/blog/o-que-e-layout-de-producao/" target="_blank">http://www.sispro.com.br/blog/o-que-e-layout-de-producao/</a></p>
</blockquote>
<p>O que norteia a escolha de um layout de produ&#xE7;&#xE3;o &#xE9; o fluxo do processo de produ&#xE7;&#xE3;o. Ou seja, a escolha de um layout se d&#xE1; tendo em mente como ser&#xE1; a produ&#xE7;&#xE3;o do produto. Haver&#xE1; v&#xE1;rios produtos sendo feitos pelas m&#xE1;quinas? O produto se movimentar&#xE1; entre as m&#xE1;quinas/pessoas?</p>
<h3 id="quais-os-tipos-de-arranjo-f&#xED;sico">Quais os tipos de arranjo f&#xED;sico?</h3>
<ul>
<li><strong>Layout de projeto</strong>: o produto permanece fixo, os recursos produtivos &#xE9; que se descolam para constru&#xED;-lo. Neste tipo de layout, &#xE9; bem comum o alto uso do sequenciamento de tarefas. Exemplo de uso s&#xE3;o a constru&#xE7;&#xE3;o de embarca&#xE7;&#xF5;es, como iates, navios...</li>
<li><strong>Centro de trabalho</strong>: o produto se movimenta entre as diversas &#xE1;reas de produ&#xE7;&#xE3;o, cada qual respons&#xE1;vel por uma opera&#xE7;&#xE3;o na constru&#xE7;&#xE3;o do produto.</li>
<li><strong>C&#xE9;lula de produ&#xE7;&#xE3;o</strong>: &#xE9; uma &#xE1;rea dedicada em que s&#xE3;o fabricados produtos semelhantes quanto aos requisitos de produ&#xE7;&#xE3;o. S&#xE3;o projetas para executar um grupo espec&#xED;fico de tarefas e produzir um grupo espec&#xED;fico de produtos.</li>
<li><strong>Linha de montagem</strong>: os processo de trabalho s&#xE3;o organizados e ordenados de acordo com o progresso de constru&#xE7;&#xE3;o do produto. Exemplo s&#xE3;o as f&#xE1;bricas de brinquedos e eletrodom&#xE9;sticos</li>
</ul>
<h3 id="quais-os-tipos-de-layout">Quais os tipos de layout?</h3>
<ul>
<li><strong>Produto</strong> ou <strong>Linear</strong>: o produto se movimenta entre as esta&#xE7;&#xF5;es de trabalho e estas v&#xE3;o finalizando processos de produ&#xE7;&#xE3;o ou adicionando pe&#xE7;as. A ordem j&#xE1; &#xE9; pr&#xE9;-estabelecida dentro do processo produtivo. A principal vantagem &#xE9; o baixo custo unit&#xE1;rio do produto, assim como baixo custo para treinamento de m&#xE3;o-de-obra. A principal desvatagem &#xE9; a facilidade de se ter gargalos. A falta de flexibilidade, baixo uso de reaproveitamento de m&#xE1;quinas e m&#xE3;o-de-obra</li>
<li><strong>Processo</strong> ou <strong>Funcional</strong>: o produto se movimenta entre as esta&#xE7;&#xF5;es, mas n&#xE3;o h&#xE1; a produ&#xE7;&#xE3;o somente de um produto, mas mais de um, com fluxo diferentes. Tem-se como vantagem a flexibilidade e portanto, seu uso &#xE9; interessante quando a produ&#xE7;&#xE3;o &#xE9; intermitente.</li>
<li><strong>Fixo</strong> ou <strong>Posicional</strong>: o produto permanece fixo, sendo que as os recursos produtivos, como m&#xE1;quinas e pessoas se movimentam para criar o produto. Uma caracter&#xED;stica interessante &#xE9; que os produtos s&#xE3;o &#xFA;nicos e n&#xE3;o repetitivos.</li>
<li><strong>Celular</strong>: todo processo de fabrica&#xE7;&#xE3;o fica dentro de uma esta&#xE7;&#xE3;o (c&#xE9;lula) de trabalho, que &#xE9; respons&#xE1;vel pela produ&#xE7;&#xE3;o de um ou mais produtos. O exemplo de uso &#xE9; uma Loja de Departamentos.</li>
</ul>
<p>Fonte importante: <a href="https://www.pciconcursos.com.br/aulas/administracao-geral/17-layout-da-producao-e-instalacao-arranjo-fisico-e-fluxo" target="_blank">https://www.pciconcursos.com.br/aulas/administracao-geral/17-layout-da-producao-e-instalacao-arranjo-fisico-e-fluxo</a> a partir do tempo 11:30</p>
<p>Playlist de consulta: <a href="https://www.pciconcursos.com.br/aulas/administracao-geral/" target="_blank">https://www.pciconcursos.com.br/aulas/administracao-geral/</a></p>
<h2 id="padroniza&#xE7;&#xE3;o-do-trabalho">Padroniza&#xE7;&#xE3;o do trabalho</h2>
<p>Porque padronizar os processos?</p>
<ul>
<li>aumento do tempo produtivo</li>
<li>redu&#xE7;&#xE3;o de falhas</li>
<li>regulamenta&#xE7;&#xE3;o das fun&#xE7;&#xF5;es</li>
</ul>
<p>Segundo Monden, a padroniza&#xE7;&#xE3;o do trabalho inclui:</p>
<ul>
<li><strong>Tempo takt</strong>: tempo m&#xE1;ximo que uma unidade do produto deve levar para ser produzida, ditado pela demanda do produto</li>
<li><strong>Rotina-padr&#xE3;o</strong>: &#xE9; um conjunto de opera&#xE7;&#xF5;es executadas por um operador em uma sequ&#xEA;ncia determinada, permitindo-lhe repetir o ciclo de forma consistente ao longo do tempo.</li>
<li><strong>Estoque padr&#xE3;o em processo</strong>: estoque necess&#xE1;rio para que a produ&#xE7;&#xE3;o se mantenha constante</li>
</ul>
<p>Ainda segundo Mondem, com a padroniza&#xE7;&#xE3;o, temos 3 objetivos:</p>
<ol>
<li>Obter alta produtividade</li>
<li>Obter balanceamento entre os diferentes processos produtivos, usando o conceito de <em>takt time</em></li>
<li>Somente uma quantidade m&#xED;nima de material &#xE9; consumida e manipulada durante o processo</li>
</ol>
<p>Segundo Spear e Bowen, as empresas precisam seguir 4 regras para ter sua padroniza&#xE7;&#xE3;o do trabalho:</p>
<ol>
<li>Todo trabalho deve ser altamente especificado quanto ao conte&#xFA;do, sequencia, andamento e resultado</li>
<li>Cada conex&#xE3;o entre cliente-fornecedor deve ser direta</li>
<li>O caminho para cada produto ou servi&#xE7;o deve ser simples e direto</li>
<li>Qualquer melhoria deve ser feita de acordo com o m&#xE9;todo cient&#xED;fico</li>
</ol>
<h3 id="diferen&#xE7;as-entre-o-takt-time-e-o-tempo-de-ciclo">Diferen&#xE7;as entre o takt time e o tempo de ciclo</h3>
<ul>
<li><strong>Takt time</strong>: ritmo de produ&#xE7;&#xE3;o necess&#xE1;rio para atender a um determinado n&#xED;vel de demanda</li>
<li><strong>Tempo de ciclo</strong>: tempo de execu&#xE7;&#xE3;o da opera&#xE7;&#xE3;o em um posto de trabalho</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="engenharia-requisitos.html" class="navigation navigation-prev " aria-label="Previous page: Engenharia de Requisitos">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="libras.html" class="navigation navigation-next " aria-label="Next page: Libras">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Modelagem de Processos Organizacionais","level":"1.4.2","depth":2,"next":{"title":"Libras","level":"1.4.3","depth":2,"path":"analise-sistemas/terceiro-periodo/libras.md","ref":"./analise-sistemas/terceiro-periodo/libras.md","articles":[]},"previous":{"title":"Engenharia de Requisitos","level":"1.4.1","depth":2,"path":"analise-sistemas/terceiro-periodo/engenharia-requisitos.md","ref":"./analise-sistemas/terceiro-periodo/engenharia-requisitos.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"root":"./resumos","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"gitbook":"*"},"file":{"path":"analise-sistemas/terceiro-periodo/modelagem-processos.md","mtime":"2018-05-09T02:01:14.546Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-05-09T02:02:37.901Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

