
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Analise e Projeto Orientados a Objeto · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="engenharia-software.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introdução
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    2° Período em Sistemas de Informação
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../../sistemas-informacao/segundo-periodo/linguagem-c.html">
            
                <a href="../../sistemas-informacao/segundo-periodo/linguagem-c.html">
            
                    
                    Linguagem C
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../../sistemas-informacao/segundo-periodo/comunicacao-dados.html">
            
                <a href="../../sistemas-informacao/segundo-periodo/comunicacao-dados.html">
            
                    
                    Comunicação de Dados
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../../sistemas-informacao/segundo-periodo/modelagem-dados.html">
            
                <a href="../../sistemas-informacao/segundo-periodo/modelagem-dados.html">
            
                    
                    Modelagem de Dados
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    2° Período em Análise de Sistemas
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.3.1" data-path="projetos-uml.html">
            
                <a href="projetos-uml.html">
            
                    
                    Analise e Projeto Orientados a Objeto
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="engenharia-software.html">
            
                <a href="engenharia-software.html">
            
                    
                    Engenharia de Software
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    3° Período em Analise de Sistemas
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../terceiro-periodo/engenharia-requisitos.html">
            
                <a href="../terceiro-periodo/engenharia-requisitos.html">
            
                    
                    Engenharia de Requisitos
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../terceiro-periodo/modelagem-processos.html">
            
                <a href="../terceiro-periodo/modelagem-processos.html">
            
                    
                    Modelagem de Processos Organizacionais
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../terceiro-periodo/libras.html">
            
                <a href="../terceiro-periodo/libras.html">
            
                    
                    Libras
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >Analise e Projeto Orientados a Objeto</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="analise-e-projeto-orientados-a-objeto">Analise e Projeto Orientados a Objeto</h1>
<p>O objetivo dessa disciplina &#xE9; prover ao aluno conhecimento e ferramenta para a An&#xE1;lise de Projetos Orientados a Objeto.</p>
<h2 id="processo-de-desenvolvimento-de-software">Processo de desenvolvimento de software</h2>
<p>Como tudo na vida, desenvolver software &#xE9; um processo que possui etapas. Sendo usadas ou n&#xE3;o, &#xE9; necess&#xE1;rio organizar os processos para softwares possam ser entregues com qualidade. A seguir, os processos para o desenvolvimento de software:</p>
<ul>
<li><strong>An&#xE1;lise</strong>: consiste em levantar os requisitos do sistema proposto com o objetivo de entender o seu funcionamento.</li>
<li><strong>Projeto</strong>: considera os aspectos l&#xF3;gicos e independentes de implementa&#xE7;&#xE3;o. Nesta fase, determina-se como o sistema funcionar&#xE1;. Como artefatos, s&#xE3;o produzidos diagramas de casos de uso, diagramas de classes entre outros.</li>
<li><strong>Implementa&#xE7;&#xE3;o</strong>: &#xE9; a fase de codifica&#xE7;&#xE3;o utilizando linguagem de programa&#xE7;&#xE3;o.</li>
<li><strong>Testes</strong>: nesta etapa s&#xE3;o realizados testes para verifica&#xE7;&#xE3;o / detec&#xE7;&#xE3;o de erros.</li>
<li><strong>Implanta&#xE7;&#xE3;o</strong>: o sistema &#xE9; impacotado, distribu&#xED;do e instalado no ambiente do usu&#xE1;rio.</li>
</ul>
<h2 id="requisitos">Requisitos</h2>
<p>&#xC9; uma condi&#xE7;&#xE3;o ou uma necessidade que o sistema se prop&#xF5;e a realizar. Podem ser de dois tipos:</p>
<h3 id="funcionais">Funcionais</h3>
<p>Definem as funcionalidades a serem desenvolvidas do sistema. Exemplo:</p>
<blockquote>
<p>O sistema deve permitir lan&#xE7;ar nota pelo professor.</p>
</blockquote>
<h3 id="n&#xE3;o-funcionais">N&#xE3;o-funcionais</h3>
<p>Declaram as caracter&#xED;sticas de qualidade que o sistema deve possuir e que est&#xE3;o relacionadas &#xE0;s suas funcionalidades. Exemplo:</p>
<blockquote>
<p>Confiabilidade, desempenho, seguran&#xE7;a...</p>
</blockquote>
<h2 id="os-diagramas-uml">Os diagramas UML</h2>
<p>A UML, sigla para Unified Modeling Language ou Linguagem de Modelagem Unificada, &#xE9; um conjunto de diagramas que tem por objetivo documentar de forma visual um software. Ela &#xE9; usada na etapa de analise e projeto no desenvolvimento de software.</p>
<p>Foi criada na d&#xE9;cada de 1990 por <a href="https://pt.wikipedia.org/wiki/James_Rumbaugh" target="_blank">James Rumbaugh</a>, <a href="https://pt.wikipedia.org/wiki/Grady_Booch" target="_blank">Grady Booch</a> e <a href="https://en.wikipedia.org/wiki/Ivar_Jacobson" target="_blank">Ivar Jacobson</a>, com o intuito de unir diferentes modelos de diagrama&#xE7;&#xE3;o orientados a objetos na &#xE9;poca.</p>
<p>Atualmente a UML est&#xE1; na sua segunda vers&#xE3;o, com 13 diagramas dividos em 3 categorias:</p>
<ul>
<li><p><strong>Diagramas de estrutura</strong>: inclui os diagramas de Classes, Objetos, Componentes, de Deploy, Pacotes e de Composi&#xE7;&#xE3;o de estrutura.</p>
</li>
<li><p><strong>Diagramas de comportamento</strong>: inclui os diagramas de Casos de Uso, Atividade e M&#xE1;quina de estados.</p>
</li>
<li><p><strong>Diagramas de intera&#xE7;&#xE3;o</strong>: inclui os diagramas de Intera&#xE7;&#xE3;o, Sequencia, Comuni&#xE7;&#xE3;o e Tempo.</p>
</li>
</ul>
<p>Aqui ser&#xE1; abordado os Diagramas de Casos de Uso, Classes, Sequencia e de M&#xE1;quinas de Estado.</p>
<hr>
<h2 id="diagrama-de-casos-de-uso">Diagrama de Casos de Uso</h2>
<blockquote>
<p>Um caso de uso representa quem faz o que (interage) com o sistema, sem considerar o comportamento interno do sistema</p>
</blockquote>
<p>Em suma, o diagrama de Casos de Uso ilustra os requisitos funcionais do sistema, sem levar em conta como isso ser&#xE1; implementado no mesmo.</p>
<h4 id="nota&#xE7;&#xE3;o">Nota&#xE7;&#xE3;o</h4>
<p><img src="../images/uml/conceitos-iniciais.PNG" alt="Conceitos Iniciais"></p>
<ul>
<li><strong>Elipse</strong>: representa o caso de uso, ou seja, as fun&#xE7;&#xF5;es/funcionalidades do sistema.</li>
<li><strong>Fronteira</strong>: retangulo que demarca o espa&#xE7;o do sistema em rela&#xE7;&#xE3;o ao espa&#xE7;o n&#xE3;o participante do sistema.</li>
<li><strong>Ator</strong>: pesssoa/outro sistema que interage com o sistema.</li>
<li><strong>Setas/Linhas</strong>: representam os relacionamentos entre atores/funcionalidades<ul>
<li>Ator prim&#xE1;rio: &#xE9; o que dispara o caso de uso. Que interaje diretamente com o caso de uso.</li>
<li>Ator secund&#xE1;rio: &#xE9; que auxilia o ator prim&#xE1;rio na execu&#xE7;&#xE3;o do caso de uso. N&#xE3;o interaje diretamente com o caso de uso.</li>
</ul>
</li>
</ul>
<h4 id="estere&#xF3;tipos-que-ocorrem-entre-casos-de-uso">Estere&#xF3;tipos que ocorrem entre casos de uso:</h4>
<h5 id="include">Include</h5>
<p>Representa um relacionamento obrigat&#xF3;rio. Exemplo: ao executar o caso de uso <code>efetuar venda</code>, obrigatoriamente ser&#xE1; executado o caso de uso <code>emitir nota fiscal</code>.</p>
<h5 id="extend">Extend</h5>
<p>Representa um relacionamento n&#xE3;o obrigat&#xF3;rio. Exemplo: para ser executado o caso de uso <code>efetuar venda</code>, n&#xE3;o &#xE9; obrigat&#xF3;rio executar o caso de uso <code>autorizar venda</code>.</p>
<p>Exemplo:</p>
<p><img src="../images/uml/extend-include-uml.PNG" alt="Exemplo de Include e Extens&#xE3;o"></p>
<h4 id="estereotipo-que-ocorre-tanto-entre-casos-de-uso-quanto-entre-atores">Estereotipo que ocorre tanto entre casos de uso quanto entre atores</h4>
<h5 id="generaliza&#xE7;&#xE3;o">Generaliza&#xE7;&#xE3;o</h5>
<p>Este relacionamento permite que um caso de uso (ator) herde caracteristicas de outro caso de uso (ator). O caso de uso (ator) herdeiro &#xE9; responsavel por implementar por si mesmo o comportamento herdado. O caso de uso (ator) herdado &#xE9; conhecido como caso de uso (ator) base.</p>
<p><img src="http://sgvclin.altervista.org/rea-uml/pop/pop-2/generali.JPG" alt="Exemplo de generalizacao"></p>
<hr>
<h2 id="diagrama-de-classes">Diagrama de Classes</h2>
<blockquote>
<p>Um Diagrama de Classes &#xE9; um diagrama do tipo est&#xE1;tico que define quais as entidades em seus sistema bem como o relacionamento entre elas.</p>
</blockquote>
<p>O diagrama de classes fornece as seguintes visualiza&#xE7;&#xF5;es:</p>
<ul>
<li><strong>Conceitual</strong>, pois fornece os principais conceitos do sistema, bem como os dom&#xED;nios do mesmo.</li>
<li><strong>Especifica&#xE7;&#xE3;o</strong>, pois oferece a possibilidade de compreender os m&#xE9;todos do sistema, sem fornecer como os mesmos ir&#xE3;o ser implementados.</li>
<li><strong>Implementa&#xE7;&#xE3;o</strong>, pois fornece os principais detalhes de implementa&#xE7;&#xE3;o do sistema, como visibilidade e tipos de atributos das classes.</li>
</ul>
<h4 id="principais-conceitos">Principais conceitos:</h4>
<p><img src="../images/uml/diagrama-classes-conceitos.PNG" alt="Principais conceitos"></p>
<h5 id="classes">Classes</h5>
<p>S&#xE3;o as abstra&#xE7;&#xF5;es das entidades. Podemos fazer paralelo com as entidades de um Modelo Entidade-Relacionamento(EE). Toda classe contem <strong>atributos</strong>, que s&#xE3;o as suas caracteristicas e pode conter <strong>m&#xE9;todos / a&#xE7;&#xF5;es</strong>, que define os comportamentos da mesma.</p>
<h5 id="relacionamentos--associa&#xE7;&#xF5;es">Relacionamentos / associa&#xE7;&#xF5;es</h5>
<p>S&#xE3;o as associa&#xE7;&#xF5;es entre as classes. Novamente, &#xE9; poss&#xED;vel fazer paralelo com o Modelo EE. Cada classe, quando em um relacionamento, desempenha um <strong>papel</strong>. Tamb&#xE9;m ocorre no relacionamento o que se chama de <strong>multiplicidade</strong>, que &#xE9; representar quantas instancias de uma classe podem se relacionamento com quantas instancias de uma outra classe.</p>
<p><img src="../images/uml/diagrama-classes1.png" alt="Exemplo de associa&#xE7;&#xE3;o"></p>
<p>Tipos de relacionamento:</p>
<h6 id="generaliza&#xE7;&#xE3;o">Generaliza&#xE7;&#xE3;o</h6>
<p>&#xC9; o ato de generalizar uma classe em outra classe. O processo oposto &#xE9; de <strong>especializa&#xE7;&#xE3;o</strong>. Neste relacionamento, h&#xE1; o conceito de heran&#xE7;a, em que a classe que herda (especializa) outra, herda suas caracteristicas. H&#xE1; alguns nomes diferentes para o que ocorre aqui, mas em suma s&#xE3;o a mesma coisa. Exemplo: <em>subclasse</em> (a que herda) e <em>superclasse</em> (a que faz herdar).</p>
<p>H&#xE1; o conceito de <strong>classe abstrata</strong> que surge. A classe abstrata, na UML, &#xE9; representada como uma classe que contem o nome em it&#xE1;lico.</p>
<p><img src="http://www.linhadecodigo.com.br/artigos/img_artigos/admilson_nogueira/uml_generalizacao.jpg" alt="Exemplo de generaliza&#xE7;&#xE3;o"></p>
<h6 id="classe-associativa">Classe associativa</h6>
<p>&#xC9; uma classe que nasce de uma associa&#xE7;&#xE3;o entre duas ou mais classes. Essa classe surge da necessidade de guardar informa&#xE7;&#xF5;es que surgem da associa&#xE7;&#xE3;o. Podemos exemplificar com a seguinte situa&#xE7;&#xE3;o: temos a classe Pessoa que se relaciona com a classe Empresa. No relacionamento entre os dois surge a classe Emprego, sendo que esta s&#xF3; existe quando ocorre o relacionamento, temos portanto uma classe associativa:</p>
<p><img src="../images/uml/diagrama-classes4.png" alt="Exemplo de classe associativa"></p>
<h6 id="agrega&#xE7;&#xE3;o">Agrega&#xE7;&#xE3;o</h6>
<p>&#xC9; quando ocorre uma associa&#xE7;&#xE3;o entre classes, em que uma &#xE9; parte e outra &#xE9; o todo. Exemplo: classe JOGADOR que se relaciona com o CLUBE que se relaciona com ASSOCIA&#xC7;&#xC3;O.</p>
<p><img src="../images/uml/diagrama-classes2.png" alt="Exemplo de agrega&#xE7;&#xE3;o"></p>
<h6 id="composi&#xE7;&#xE3;o">Composi&#xE7;&#xE3;o</h6>
<p>&#xC9; quando ocorre uma associa&#xE7;&#xE3;o entre classes, em que a classe TODO &#xE9; respons&#xE1;vel pelas suas partes de tal forma que se a classe TODO deixa de existir, as suas partes tamb&#xE9;m.</p>
<p><img src="../images/uml/diagrama-classes3.png" alt="Exemplo de composi&#xE7;&#xE3;o"></p>
<h6 id="associa&#xE7;&#xF5;es-reflexivas">Associa&#xE7;&#xF5;es reflexivas</h6>
<p>&#xC9; quando a classe se associase a ela mesma. Conhecido no Modelo EE como Auto Relacionamento.</p>
<hr>
<h2 id="diagrama-de-estados">Diagrama de estados</h2>
<blockquote>
<p>&#xC9; o diagrama que representa as mudan&#xE7;as de estado de um objeto no sistema</p>
</blockquote>
<h3 id="conceitos-apresentados-no-livro-princ&#xED;pios-da-uml-do-bezerra">Conceitos apresentados no livro Princ&#xED;pios da UML, do Bezerra</h3>
<h4 id="estado">Estado</h4>
<p>Um estado &#xE9; uma situa&#xE7;&#xE3;o na vida de um objeto durante a qual ele satisfaz algu&#xAD;ma condi&#xE7;&#xE3;o ou realiza alguma atividade. Um estado tem a ver com o valor de um atributo do objeto, como por exemplo, dizer-se que uma conta banc&#xE1;ria est&#xE1; vermelha.</p>
<h4 id="transi&#xE7;&#xF5;es">Transi&#xE7;&#xF5;es</h4>
<p>Os estados est&#xE3;o associados a outros pelas transi&#xE7;&#xF5;es. Uma transi&#xE7;&#xE3;o &#xE9; mostrada como uma linha conectando estados, com uma seta apontando para um dos es&#xAD;tados. Quando ocorre uma transi&#xE7;&#xE3;o entre estados, diz-se que a transi&#xE7;&#xE3;o foi dis&#xAD;parada.</p>
<h4 id="evento">Evento</h4>
<p>Uma transi&#xE7;&#xE3;o possui um evento associado. Um evento &#xE9; algo que acontece em algum ponto no tempo e que pode modificar o estado de um objeto.</p>
<h4 id="condi&#xE7;&#xE3;o-de-guarda">Condi&#xE7;&#xE3;o de guarda</h4>
<p>&#xC9; uma expressao que retorna um valor l&#xF3;gico. Ela &#xE9; acionada quando o objeto vai mudar de estado. Se retornar positivo, ocorre a mudan&#xE7;a, do contr&#xE1;rio, n&#xE3;o ocorre.</p>
<h4 id="a&#xE7;&#xF5;es">A&#xE7;&#xF5;es</h4>
<p>Ao passar de um estado para um outro, o objeto pode executar uma ou mais a&#xE7;&#xF5;es.</p>
<h4 id="estados-aninhados">Estados aninhados</h4>
<p>Ocorre quando um estado possui outros estados dentro de si. Tamb&#xE9;m &#xE9; conhecido como <em>estado composto</em>.</p>
<p>Exemplo b&#xE1;sico</p>
<p><img src="../images/uml/diagrama-estados1.png" alt="Exemplos b&#xE1;sicos"></p>
<p>Exemplo um pouco mais complexo</p>
<p><img src="../images/uml/diagrama-estados2.png" alt="Exemplos um pouco mais complexo"></p>
<h2 id="diagrama-de-sequencia">Diagrama de sequencia</h2>
<blockquote>
<p>O objetivo deste diagrama &#xE9; explicitar a intera&#xE7;&#xE3;o entre objetos numa ordem temporal em que elas acontecem.</p>
</blockquote>
<p>Elementos:</p>
<h3 id="linha-de-vida">Linha de vida</h3>
<p>Uma linha de vida mostra o tempo a qual o objeto tem sua &quot;vida&quot; no sistema.</p>
<p>Exemplos de linha de vida:</p>
<p><img src="../images/uml/diagrama-estados3.png" alt="Exemplos de linha de vida"></p>
<h3 id="mensagem">Mensagem</h3>
<p>Uma mensagem &#xE9; quando um objeto envia uma a&#xE7;&#xE3;o a outro. Neste diagrama, uma mensagem &#xE9; referenciada como uma seta entre uma linha de vida e outra</p>
<p>Exemplos de formatos de mensagens</p>
<p><img src="../images/uml/diagrama-estados4.png" alt="Exemplos de formatos de mensagens"></p>
<p>Exemplo de diagrama de sequencia</p>
<p><img src="https://www.ime.usp.br/~kon/MAC5715/2002/DesignFest/M2/diagramaDeSequenciaDeEscolheSessao.jpg" alt="Exemplo de diagrama de sequencia"></p>
<p>&#xC9; importante entender o fluxo no diagrama acima, num padr&#xE3;o MVC:</p>
<blockquote>
<p>O ator que interage dispara o fluxo. Ele interage com o controlador ou a view. Se for a view, est&#xE1; emite uma mensagem para o controlador para que este converse com a classe de neg&#xF3;cio, que cont&#xE9;m o m&#xE9;todo necess&#xE1;rio a a&#xE7;&#xE3;o.</p>
</blockquote>
<p>Exemplo com figuras para o controler e view</p>
<p><img src="https://i.stack.imgur.com/eb7WB.png" alt="Exemplo com figuras para o controler e view"></p>
<hr>
<h2 id="diagrama-de-pacotes">Diagrama de pacotes:</h2>
<blockquote>
<p>&#xC9; um agrupamento da UML que define os relacionamentos entre grupos de classes do sistema. Eles s&#xE3;o importantes para agrupar as classes do sistema.</p>
</blockquote>
<p>Exemplo:</p>
<p><img src="http://micreiros.com/wp-content/uploads/1-5.png" alt="Exemplo de uma diagrama de pacotes"></p>
<hr>
<h2 id="diagrama-de-componentes">Diagrama de componentes:</h2>
<blockquote>
<p>Exemplifica os componentes do sistema, ele &#xE9; mais voltado a parte de implementa&#xE7;&#xE3;o do sistema</p>
</blockquote>
<p>Exemplo:</p>
<p><img src="http://slideplayer.com.br/slide/1250292/3/images/16/Exemplo+de+um+Diagrama+de+Componentes.jpg" alt="Exemplo de diagrama de componentes"></p>
<h2 id="referencias">Referencias:</h2>
<ul>
<li><a href="http://www.uml.org/" target="_blank">Site oficial da UML</a></li>
<li><a href="https://pt.wikipedia.org/wiki/Wikip%C3%A9dia:P%C3%A1gina_principal" target="_blank">Wikipedia</a></li>
<li>Livro Principios da UML do Bezerra</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="engenharia-software.html" class="navigation navigation-next navigation-unique" aria-label="Next page: Engenharia de Software">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Analise e Projeto Orientados a Objeto","level":"1.3.1","depth":2,"next":{"title":"Engenharia de Software","level":"1.3.2","depth":2,"path":"analise-sistemas/segundo-periodo/engenharia-software.md","ref":"./analise-sistemas/segundo-periodo/engenharia-software.md","articles":[]},"previous":{"title":"2° Período em Análise de Sistemas","level":"1.3","depth":1,"ref":"","articles":[{"title":"Analise e Projeto Orientados a Objeto","level":"1.3.1","depth":2,"path":"analise-sistemas/segundo-periodo/projetos-uml.md","ref":"./analise-sistemas/segundo-periodo/projetos-uml.md","articles":[]},{"title":"Engenharia de Software","level":"1.3.2","depth":2,"path":"analise-sistemas/segundo-periodo/engenharia-software.md","ref":"./analise-sistemas/segundo-periodo/engenharia-software.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":[],"root":"./resumos","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"gitbook":"*"},"file":{"path":"analise-sistemas/segundo-periodo/projetos-uml.md","mtime":"2018-03-31T17:41:52.208Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-05-09T02:02:37.901Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

